//ODEVFNLJ JOB 1,CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*----------------------COMPILE----------------------------
//COMP0100  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(FINALSUB),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(FINALSUB),DISP=SHR
//COMP0200  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(FINALCBL),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(FINALCBL),DISP=SHR
//LKED.SYSLIB  DD DSN=&SYSUID..LOAD,DISP=SHR
//LKED.SYSIN DD *
  INCLUDE SYSLIB(FINALSUB)
//*
// IF RC < 5 THEN
//DELET100 EXEC PGM=IEFBR14
//THEFILE   DD DSN=&SYSUID..QSAM.OUT,
// DISP=(MOD,DELETE,DELETE),SPACE=(TRK,0)
//*----------------------RUN--------------------------------
//RUN     EXEC PGM=FINALCBL
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//IDXFILE  DD DSN=&SYSUID..VSAM.IN,DISP=SHR
//OUTFILE   DD DSN=&SYSUID..QSAM.OUT,DISP=(NEW,CATLG,DELETE),
//          SPACE=(TRK,(150,10))
//INPFILE DD DSN=&SYSUID..QSAM.IN,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//SYSERROR  DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
// ELSE
// ENDIF